{
  "lastUpdate": "2025-10-25T00:04:33.399Z",
  "data": [
    {
      "id": "01k8b907jxpvvv1mpxw61yy9td",
      "title": "Nixifying Kubernetes with nix-csi, easykubenix and dinix",
      "url": "https://discourse.nixos.org/t/nixifying-kubernetes-with-nix-csi-easykubenix-and-dinix/70899",
      "savedAt": "2025-10-24T14:12:15.069000+00:00",
      "description": "The author built three Nix-based projects to manage Kubernetes: easykubenix (renders manifests and deploys with kluctl), nix-csi (provides Nix store volumes via CSI), and dinix (renders dinit service configs). Together they let you run minimal container images and manage full container lifecycles with Nix. The projects work but need more docs and community feedback.",
      "tags": [
        "tools/nix"
      ]
    },
    {
      "id": "01k88h519bmeyg9n24cd15qbmh",
      "title": "Contents",
      "url": "https://404wolf.com/posts/whirlwindtourofnix/",
      "savedAt": "2025-10-23T12:36:57.771000+00:00",
      "description": "Nix is a flexible toolset for reproducible builds, package management, and declarative system configuration.  \nIt uses pure, sandboxed builds, derivations, and a central nixpkgs library to make consistent developer environments.  \nFlakes and utilities like flake-utils simplify multi-system outputs and packaging workflows.",
      "tags": [
        "tools/nix"
      ]
    },
    {
      "id": "01k88dr0f6ngmxd02v8mekjee6",
      "title": "A window into modern loan origination",
      "url": "https://www.bitsaboutmoney.com/archive/window-modern-loan-origination/",
      "savedAt": "2025-10-23T11:37:25.222000+00:00",
      "description": "Window sellers prefer financeable purchases because on-the-spot loans boost sales and simplify operations. Specialized facilitators, banks, and private capital quickly create short-term loans that fund installations while shifting most risk off bank balance sheets. This setup lets installers sell windows at scale with predictable, fast financing that investors package and buy.",
      "tags": [
        "economy"
      ]
    },
    {
      "id": "01k8765nm1fsfce4d47fz3w5nc",
      "title": "nLab computational trilogy",
      "url": "https://ncatlab.org/nlab/show/computational+trilogy",
      "savedAt": "2025-10-23T00:05:49.825000+00:00",
      "description": "Three branches of mathematics—logic, type theory (languages), and category theory—are three perspectives on the same underlying notion of computation. This \"computational trinitarianism\" shows concepts in one area correspond to concepts in the others. Recent work extends these equivalences to quantum computation and homotopy/topological (twisted cohomology) settings.",
      "tags": [
        "cs",
        "math"
      ]
    }
  ]
}